[
    {
      "bookid": 1,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "catcher_in_the_rye.jpg",
      "review": "A timeless classic exploring the complexities of adolescence and societal expectations. Holden Caulfield's journey is both poignant and thought-provoking. Salinger's masterful prose captures the essence of teenage angst and rebellion, resonating with readers across generations.",
      "totalPages": 277,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Coming-of-age", "Literary Fiction"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookid": 2,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "1984.jpg",
      "review": "A dystopian masterpiece that remains eerily relevant. Orwell's depiction of a totalitarian regime serves as a chilling warning about the dangers of unchecked government power. With its themes of surveillance, propaganda, and oppression, '1984' continues to provoke thought and spark discussions about the nature of authority and freedom.",
      "totalPages": 328,
      "rating": 4.5,
      "category": "Science Fiction",
      "tags": ["Dystopian", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookid": 3,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "to_kill_a_mockingbird.jpg",
      "review": "A profound narrative addressing racial injustice and moral growth in the American South. Atticus Finch's integrity and empathy resonate with readers of all ages. Harper Lee's exploration of the complexities of human nature and the pursuit of justice makes 'To Kill a Mockingbird' a timeless classic that continues to inspire and provoke reflection.",
      "totalPages": 324,
      "rating": 4.6,
      "category": "Classics",
      "tags": ["Legal Drama", "Southern Gothic"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookid": 4,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "the_great_gatsby.jpg",
      "review": "A glittering portrayal of the Jazz Age's excesses and the elusive American Dream. Fitzgerald's prose is as captivating as the enigmatic Jay Gatsby himself. Through vivid imagery and compelling characters, 'The Great Gatsby' offers a poignant critique of wealth, ambition, and the pursuit of happiness.",
      "totalPages": 180,
      "rating": 4.2,
      "category": "Classics",
      "tags": ["Romance", "Tragedy"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "bookid": 5,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "pride_and_prejudice.jpg",
      "review": "A delightful exploration of love, class, and societal norms in Regency England. Austen's wit and keen observation make this a timeless favorite. 'Pride and Prejudice' offers a nuanced portrayal of relationships and social dynamics, with memorable characters and sparkling dialogue that continue to enchant readers.",
      "totalPages": 279,
      "rating": 4.7,
      "category": "Romance",
      "tags": ["Regency Era", "Social Commentary"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookid": 6,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "the_hobbit.jpg",
      "review": "A captivating adventure through Middle-earth that transports readers to a realm of magic and heroism. Bilbo Baggins's journey is as heartwarming as it is thrilling. Tolkien's richly imagined world, populated by elves, dwarves, and dragons, invites readers on an epic quest filled with danger, friendship, and courage.",
      "totalPages": 310,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["Adventure", "Quest"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1937
    }
  ]
